<?php
/**
 * I18n catalog
 * @author Nikolay Ermin <nikolay@ermin.ru>
 * @link   http://siteforever.ru
 */

return array(
    'Catalog'   => 'Каталог',
    'Trage'     => 'Товар',
    'Gallery' => 'Галерея',
    'Path'      => 'Путь',
    'No products' => 'Нет товаров',
    'In total'  => 'Итого',
    'Calculate' => 'Пересчитать',
    'DoOrder' => 'Заказать',
    'Sort' => 'Сортировка',

    'Default' => 'По умолчанию',
    'Delete' => 'Удалить',
    'Add image' => 'Добавить изображение',
    'Images not found' => 'Изображения не найдены',
    'No image' => 'Нет изображения',

    'Main' => 'Главная',
    'Properties' => 'Свойства',
    'Text' => 'Текст',
    'Protected' => 'Защита',

    'Фильтр по артикулу',
    'Введите часть артикула',
    'Применить',
    'Отменить',
    'Наименование',
    'Порядок',
    'Артикул',
    'Действия',
    'Править',
    'Включить',
    'Выключить',
    'Добавить подраздел',
    'Добавить товар',
    'Удалить',
    'Пока нет разделов',
    'Переместить',
    'Сохранить порядок',
);